{
  "<pad>": 0,
  "<sos>": 1,
  "<eos>": 2,
  "<unk>": 3,
  "nhà": 4,
  "chùa": 5,
  "một": 6,
  "hà": 7,
  "và": 8,
  "cổng": 9,
  "kiến": 10,
  "trúc": 11,
  "cầu": 12,
  "lăng": 13,
  "của": 14,
  "nội": 15,
  "sàn": 16,
  "thờ": 17,
  "minh": 18,
  "hồ": 19,
  "ở": 20,
  "văn": 21,
  "cổ": 22,
  "an": 23,
  "thành": 24,
  "tam": 25,
  "hội": 26,
  "ngôi": 27,
  "tháp": 28,
  "hoàng": 29,
  "phố": 30,
  "định": 31,
  "ngọc": 32,
  "chí": 33,
  "truyền": 34,
  "biệt": 35,
  "phần": 36,
  "chủ": 37,
  "cột": 38,
  "việt": 39,
  "long": 40,
  "nam": 41,
  "ba": 42,
  "đức": 43,
  "nội.": 44,
  "cao": 45,
  "tịch": 46,
  "đền": 47,
  "quốc": 48,
  "thống": 49,
  "đình": 50,
  "tây": 51,
  "rùa": 52,
  "đồng": 53,
  "pháp": 54,
  "trong": 55,
  "quan": 56,
  "cung": 57,
  "huế": 58,
  "sự": 59,
  "đài": 60,
  "chợ": 61,
  "miếu": 62,
  "chính": 63,
  "độc": 64,
  "khải": 65,
  "huế.": 66,
  "thê": 67,
  "điện": 68,
  "húc": 69,
  "biên": 70,
  "thự": 71,
  "lớn": 72,
  "kiểu": 73,
  "lịch": 74,
  "bà": 75,
  "sài": 76,
  "bản": 77,
  "cửa": 78,
  "tử": 79,
  "hát": 80,
  "dinh": 81,
  "tại": 82,
  "ngọ": 83,
  "nam.": 84,
  "chúc": 85,
  "tự": 86,
  "trấn": 87,
  "bái": 88,
  "gòn": 89,
  "dài": 90,
  "ê": 91,
  "đê": 92,
  "khác": 93,
  "tâm": 94,
  "lập": 95,
  "giám": 96,
  "nhật": 97,
  "tượng": 98,
  "về": 99,
  "lễ": 100,
  "làng": 101,
  "thanh": 102,
  "thất": 103,
  "mạng": 104,
  "hiện": 105,
  "xuân": 106,
  "h'mông": 107,
  "miền": 108,
  "vườn": 109,
  "khu": 110,
  "mô": 111,
  "trường": 112,
  "môn": 113,
  "đen": 114,
  "trung": 115,
  "đính": 116,
  "hóa": 117,
  "kinh": 118,
  "quảng": 119,
  "hình": 120,
  "bắc": 121,
  "bộ": 122,
  "bưu": 123,
  "thăng": 124,
  "mái": 125,
  "biểu": 126,
  "gothic": 127,
  "đinh": 128,
  "đình,": 129,
  "cờ": 130,
  "vào": 131,
  "phật": 132,
  "rồng": 133,
  "hoàn": 134,
  "cảnh": 135,
  "thể": 136,
  "người": 137,
  "quy": 138,
  "trang": 139,
  "vật": 140,
  "góc": 141,
  "giáo": 142,
  "tín": 143,
  "bảng": 144,
  "gian": 145,
  "tòa": 146,
  "thuộc": 147,
  "sử": 148,
  "đại": 149,
  "hoặc": 150,
  "hoàng.": 151,
  "hai": 152,
  "di": 153,
  "ngưỡng": 154,
  "an.": 155,
  "không": 156,
  "sử,": 157,
  "cây": 158,
  "bậc": 159,
  "thánh": 160,
  "rường": 161,
  "công": 162,
  "là": 163,
  "thang": 164,
  "phủ": 165,
  "trên": 166,
  "hóa.": 167,
  "môn,": 168,
  "xuân,": 169,
  "tôn": 170,
  "quốc,": 171,
  "trình": 172,
  "kiếm,": 173,
  "địa": 174,
  "phong": 175,
  "bảo": 176,
  "paris": 177,
  "chùa.": 178,
  "gỗ": 179,
  "sổ": 180,
  "ruộng": 181,
  "đài.": 182,
  "hóa,": 183,
  "ninh": 184,
  "có": 185,
  "tiết": 186,
  "đại.": 187,
  "ảnh": 188,
  "kết": 189,
  "(hoặc": 190,
  "hùng": 191,
  "con": 192,
  "hòa": 193,
  "với": 194,
  "chi": 195,
  "sản": 196,
  "trí": 197,
  "xung": 198,
  "phát": 199,
  "bàn": 200,
  "thiên": 201,
  "giữa": 202,
  "giao": 203,
  "âm": 204,
  "nghi": 205,
  "vẽ": 206,
  "thống.": 207,
  "dẫn": 208,
  "các": 209,
  "trị": 210,
  "cộng": 211,
  "quần": 212,
  "dân": 213,
  "dây": 214,
  "họ": 215,
  "sơn": 216,
  "cách": 217,
  "đức.": 218,
  "tồn": 219,
  "nha": 220,
  "tường": 221,
  "khuôn": 222,
  "viên": 223,
  "bia": 224,
  "kính": 225,
  "liệu,": 226,
  "giá": 227,
  "pha": 228,
  "trộn": 229,
  "bạch": 230,
  "định.": 231,
  "thoa": 232,
  "đông": 233,
  "bến": 234,
  "phục": 235,
  "tranh": 236,
  "bên": 237,
  "nhỏ": 238,
  "sân": 239,
  "đặc": 240,
  "du": 241,
  "mã": 242,
  "lối": 243,
  "trước": 244,
  "hoa": 245,
  "long.": 246,
  "văng": 247,
  "hài": 248,
  "tiên": 249,
  "sống": 250,
  "mộ": 251,
  "trúc,": 252,
  "nghệ": 253,
  "nghiêm": 254,
  "quyền": 255,
  "ánh": 256,
  "kiếm": 257,
  "hoá": 258,
  "mạng.": 259,
  "trưng": 260,
  "hợp": 261,
  "lá": 262,
  "linh": 263,
  "mô,": 264,
  "cấu": 265,
  "liệu": 266,
  "đáo": 267,
  "quanh.": 268,
  "hùng.": 269,
  "phước": 270,
  "nước": 271,
  "á": 272,
  "tiền": 273,
  "đây": 274,
  "phản": 275,
  "triển": 276,
  "họa": 277,
  "thêm": 278,
  "tin": 279,
  "để": 280,
  "ý": 281,
  "sử.": 282,
  "gia": 283,
  "điểm": 284,
  "hưởng": 285,
  "đoan": 286,
  "đang": 287,
  "tho": 288,
  "chiếc": 289,
  "hoang": 290,
  "đen.": 291,
  "chuông": 292,
  "cổ.": 293,
  "thờ.": 294,
  "minh.": 295,
  "lư": 296,
  "phòng": 297,
  "biệt.": 298,
  "cần": 299,
  "so": 300,
  "sánh": 301,
  "nhiều": 302,
  "(hay": 303,
  "ngói": 304,
  "màu": 305,
  "ban": 306,
  "bình": 307,
  "đá": 308,
  "quốc.": 309,
  "gắn": 310,
  "bai": 311,
  "tế": 312,
  "3d": 313,
  "vị": 314,
  "trí.": 315,
  "điển": 316,
  "dáng.": 317,
  "(sài": 318,
  "gòn)": 319,
  "rước": 320,
  "hương": 321,
  "ninh.": 322,
  "thông": 323,
  "gòn.": 324,
  "đường": 325,
  "nghĩa": 326,
  "đồ": 327,
  "đồng.": 328,
  "vẻ": 329,
  "gỗ,": 330,
  "đa": 331,
  "trọng": 332,
  "tinh": 333,
  "toàn": 334,
  "hoạt": 335,
  "liệu.": 336,
  "gươm": 337,
  "hải": 338,
  "xuân.": 339,
  "thờ)": 340,
  "nhiên.": 341,
  "xây": 342,
  "dựng": 343,
  "thiết": 344,
  "mang": 345,
  "(thanh": 346,
  "thất)": 347,
  "rồng,": 348,
  "màu.": 349,
  "chạm": 350,
  "khắc": 351,
  "cuộc": 352,
  "buổi": 353,
  "diễn": 354,
  "tích": 355,
  "hành": 356,
  "hội.": 357,
  "bác": 358,
  "tương": 359,
  "đền,": 360,
  "may": 361,
  "đen,": 362,
  "tầng": 363,
  "tu": 364,
  "-": 365,
  "bằng": 366,
  "hàng": 367,
  "giáo.": 368,
  "cụ": 369,
  "thể.": 370,
  "đến": 371,
  "cong,": 372,
  "dạng": 373,
  "cấp": 374,
  "chứng": 375,
  "đẹp": 376,
  "nhiên": 377,
  "tầng,": 378,
  "bối": 379,
  "tính": 380,
  "đoạn": 381,
  "xe": 382,
  "(phủ": 383,
  "quá": 384,
  "việt.": 385,
  "đính,": 386,
  "nhỏ.": 387,
  "tộc": 388,
  "định,": 389,
  "nhà.": 390,
  "vàng": 391,
  "(chùa": 392,
  "lu": 393,
  "đính.": 394,
  "đêm": 395,
  "nội)": 396,
  "phương": 397,
  "thức": 398,
  "mắn,": 399,
  "phía": 400,
  "vua": 401,
  "lang": 402,
  "nhau.": 403,
  "linh.": 404,
  "phỏng": 405,
  "bộ.": 406,
  "mặt": 407,
  "lịch.": 408,
  "trúc.": 409,
  "giữ": 410,
  "gìn": 411,
  "đá.": 412,
  "lực": 413,
  "áo": 414,
  "trụ,": 415,
  "ngói,": 416,
  "sinh": 417,
  "mô.": 418,
  "quanh": 419,
  "thần": 420,
  "chất": 421,
  "biên.": 422,
  "hồng": 423,
  "kien": 424,
  "nằm": 425,
  "đáo,": 426,
  "bức": 427,
  "sơn,": 428,
  "thế": 429,
  "(cột": 430,
  "lông": 431,
  "vợt": 432,
  "trò": 433,
  "kiếm.": 434,
  "cầu)": 435,
  "yếu": 436,
  "đầu": 437,
  "giám.": 438,
  "chụp": 439,
  "thiêng.": 440,
  "tiết.": 441,
  "chúc.": 442,
  "loại": 443,
  "phú": 444,
  "thuật": 445,
  "khuê": 446,
  "niềm": 447,
  "thịnh": 448,
  "vượng": 449,
  "sở": 450,
  "thang.": 451,
  "sắc": 452,
  "sông.": 453,
  "gạch,": 454,
  "đáo.": 455,
  "đền.": 456,
  "vườn.": 457,
  "pháp.": 458,
  "xã": 459,
  "qua": 460,
  "vệ": 461,
  "dục": 462,
  "đổi": 463,
  "môi": 464,
  "gia.": 465,
  "dương": 466,
  "rõ": 467,
  "rệt": 468,
  "biểu.": 469,
  "đi": 470,
  "tăng": 471,
  "ngày": 472,
  "núi": 473,
  "tịch)": 474,
  "thuyền": 475,
  "h'mông.": 476,
  "bán": 477,
  "–": 478,
  "thời": 479,
  "hôn": 480,
  "chúc,": 481,
  "bó": 482,
  "sông": 483,
  "nét": 484,
  "tràng": 485,
  "nông": 486,
  "đèn": 487,
  "lồng": 488,
  "bình.": 489,
  "dáng": 490,
  "quả": 491,
  "lông.": 492,
  "lập.": 493,
  "vinh": 494,
  "mây,": 495,
  "hồi": 496,
  "những": 497,
  "lớn.": 498,
  "sai": 499,
  "bày": 500,
  "nhỏ)": 501,
  "sàn.": 502,
  "gỗ.": 503,
  "đạo": 504,
  "lực,": 505,
  "hoàng)": 506,
  "xanh": 507,
  "rộng": 508,
  "lưu": 509,
  "niệm": 510,
  "cơ": 511,
  "hạ": 512,
  "tấm": 513,
  "ngưỡng,": 514,
  "huế,": 515,
  "nguồn": 516,
  "âu": 517,
  "ô": 518,
  "chào": 519,
  "(cửa": 520,
  "nghiên": 521,
  "cứu": 522,
  "nổi": 523,
  "khí": 524,
  "kim": 525,
  "bị": 526,
  "nền": 527,
  "trụ": 528,
  "an,": 529,
  "thượng": 530,
  "sàn,": 531,
  "tranh.": 532,
  "nối,": 533,
  "chức": 534,
  "kỹ": 535,
  "sộ,": 536,
  "gạch": 537,
  "đời": 538,
  "nhân": 539,
  "tranh,": 540,
  "thích": 541,
  "đá,": 542,
  "tân": 543,
  "động": 544,
  "mới": 545,
  "thuật,": 546,
  "sâu": 547,
  "ngưỡng.": 548,
  "tộc.": 549,
  "tầm": 550,
  "khung": 551,
  "30/4/1975.": 552,
  "mạo)": 553,
  "đuc": 554,
  "vùng": 555,
  "quầy": 556,
  "chè": 557,
  "đà": 558,
  "bắc.": 559,
  "mật": 560,
  "thôn": 561,
  "tiến": 562,
  "sĩ": 563,
  "hình.": 564,
  "sư": 565,
  "rông": 566,
  "phao": 567,
  "(cầu": 568,
  "nổi)": 569,
  "tháp.": 570,
  "lọ": 571,
  "vắc": 572,
  "xin": 573,
  "phế": 574,
  "cầu.": 575,
  "đền/chùa": 576,
  "quê": 577,
  "(hoàn": 578,
  "kiếm),": 579,
  "pho": 580,
  "canterbury": 581,
  "đình/miếu": 582,
  "diệm": 583,
  "phan": 584,
  "ha": 585,
  "noi": 586,
  "(bảo": 587,
  "tàng": 588,
  "minh)": 589,
  "hộp": 590,
  "quạt": 591,
  "nhựa.": 592,
  "chơi": 593,
  "làng.": 594,
  "rừng.": 595,
  "lực.": 596,
  "tiện": 597,
  "chuyển": 598,
  "tiếp": 599,
  "khách": 600,
  "lá.": 601,
  "(còn": 602,
  "gọi": 603,
  "nhưng": 604,
  "(bái": 605,
  "đình)": 606,
  "khâm": 607,
  "thừa": 608,
  "thiên)": 609,
  "chartres": 610,
  "diễu": 611,
  "thuần": 612,
  "khiết": 613,
  "thế,": 614,
  "mặc": 615,
  "cường": 616,
  "theo": 617,
  "đặt": 618,
  "lúc": 619,
  "viện": 620,
  "westminster": 621,
  "thự.": 622,
  "norodom)": 623,
  "ăn": 624,
  "cơm.": 625,
  "dân.": 626,
  "lên": 627,
  "kỳ": 628,
  "phổ": 629,
  "độ.": 630,
  "tự)": 631,
  "miếu)": 632,
  "tạo": 633,
  "bồn": 634,
  "ngồi": 635,
  "bệt.": 636,
  "cong": 637,
  "liễn": 638,
  "văng.": 639,
  "mũ": 640,
  "khuỷu": 641,
  "tay.": 642,
  "vuon": 643,
  "hue": 644,
  "2": 645,
  "rùa)": 646,
  "được": 647,
  "đô": 648,
  "thị.": 649,
  "châu": 650,
  "kỷ": 651,
  "17-18.": 652,
  "đình.": 653,
  "dầu": 654,
  "bao": 655,
  "cùng": 656,
  "giếng": 657,
  "loại.": 658,
  "mãng": 659,
  "xiêm": 660,
  "buồm": 661,
  "nam)": 662,
  "phá": 663,
  "hủy.": 664,
  "đình/đền": 665,
  "duomo": 666,
  "milan,": 667,
  "khiết.": 668,
  "hương.": 669,
  "tẩm": 670,
  "đoàn": 671,
  "vách": 672,
  "canh.": 673,
  "quan.": 674,
  "lệ": 675,
  "đạp": 676,
  "cam": 677,
  "vé": 678,
  "tượng.": 679,
  "hoạch": 680,
  "thiện": 681,
  "lẫn": 682,
  "long,": 683,
  "san": 684,
  "thất.": 685,
  "năng": 686,
  "tư": 687,
  "sau": 688,
  "vụ": 689,
  "hỏa": 690,
  "hoạn.": 691,
  "viết": 692,
  "thư": 693,
  "vực": 694,
  "tầng.": 695,
  "ngoài": 696,
  "trời": 697,
  "người.": 698,
  "đáng": 699,
  "phụ": 700,
  "nữ": 701,
  "kỳ.": 702,
  "trọng,": 703,
  "nghi.": 704,
  "bà)": 705,
  "thẩm": 706,
  "mỹ": 707,
  "nguyễn.": 708,
  "hoá.": 709,
  "thuật.": 710,
  "lịch,": 711,
  "nối": 712,
  "đỏ": 713,
  "dương,": 714,
  "nhà,": 715,
  "liền": 716,
  "thống,": 717,
  "kế": 718,
  "nơi": 719,
  "tế,": 720,
  "nước,": 721,
  "đẳng": 722,
  "sầm": 723,
  "uất": 724,
  "rộng.": 725,
  "cảnh.": 726,
  "xuống": 727,
  "lâu": 728,
  "dáng,": 729,
  "đại,": 730,
  "đơn": 731,
  "giản": 732,
  "vòm": 733,
  "nhọn,": 734,
  "thường": 735,
  "sản,": 736,
  "hào": 737,
  "mạnh": 738,
  "mẽ": 739,
  "lý": 740,
  "cách.": 741,
  "năng.": 742,
  "vai": 743,
  "phi": 744,
  "hơn.": 745,
  "cúng.": 746,
  "lu,": 747,
  "kem": 748,
  "que.": 749,
  "lan": 750,
  "can": 751,
  "báo": 752,
  "jun.": 753,
  "cư.": 754,
  "nẵng": 755,
  "phun": 756,
  "thành.": 757,
  "(đại": 758,
  "huế)": 759,
  "chế": 760,
  "phẩm": 761,
  "đậm": 762,
  "tái": 763,
  "trần": 764,
  "hải)": 765,
  "lư,": 766,
  "tích.": 767,
  "bố": 768,
  "cục.": 769,
  "cot": 770,
  "co": 771,
  "nhóm": 772,
  "ngũ": 773,
  "sơn.": 774,
  "chòi/chái": 775,
  "vận": 776,
  "cảng": 777,
  "nhất)": 778,
  "buu": 779,
  "giương": 780,
  "nó.": 781,
  "đê.": 782,
  "giày": 783,
  "thương": 784,
  "hiệu": 785,
  "mizuno.": 786,
  "từ": 787,
  "đường.": 788,
  "54,": 789,
  "hôn.": 790,
  "(hà": 791,
  "milan": 792,
  "(duomo": 793,
  "milano)": 794,
  "cũ)": 795,
  "khiêm": 796,
  "lăng,": 797,
  "tăng.": 798,
  "cây,": 799,
  "vành.": 800,
  "mù": 801,
  "cang": 802,
  "chải,": 803,
  "yên": 804,
  "bái.": 805,
  "gươm,": 806,
  "(jade": 807,
  "emperor": 808,
  "pagoda)": 809,
  "hữu": 810,
  "(chùa)": 811,
  "bục": 812,
  "thuyết": 813,
  "đền/miếu": 814,
  "sống,": 815,
  "khởi": 816,
  "bổ": 817,
  "căn": 818,
  "tưởng": 819,
  "lạt": 820,
  "thap": 821,
  "đông)": 822,
  "(đền": 823,
  "đền/chùa.": 824,
  "chủ.": 825,
  "thuận": 826,
  "ngăn.": 827,
  "duyên": 828,
  "(có": 829,
  "làng)": 830,
  "hải.": 831,
  "dãy": 832,
  "thành,": 833,
  "sửa": 834,
  "chữa": 835,
  "húc.": 836,
  "bé": 837,
  "gái.": 838,
  "phố.": 839,
  "bảng.": 840,
  "york": 841,
  "minster": 842,
  "anh.": 843,
  "bút": 844,
  "chương": 845,
  "thu": 846,
  "lúa": 847,
  "cũ": 848,
  "bac": 849,
  "ma": 850,
  "pickleball": 851,
  "riêng": 852,
  "điều": 853,
  "khí.": 854,
  "chưởng": 855,
  "bản,": 856,
  "kể.": 857,
  "linh,": 858,
  "lao": 859,
  "triều": 860,
  "nón": 861,
  "thái": 862,
  "ngập": 863,
  "lụt.": 864,
  "xảo.": 865,
  "tượng,": 866,
  "thông.": 867,
  "biển.": 868,
  "công,": 869,
  "cửa...": 870,
  "màn": 871,
  "đốt": 872,
  "tỏ": 873,
  "lòng": 874,
  "hình,": 875,
  "nguyên": 876,
  "vẹn.": 877,
  "ống,": 878,
  "sát": 879,
  "nung": 880,
  "dấu": 881,
  "ấn": 882,
  "âu.": 883,
  "mát": 884,
  "nghiệp": 885,
  "rực": 886,
  "rỡ": 887,
  "gothic,": 888,
  "nghỉ": 889,
  "ngơi": 890,
  "cư": 891,
  "trú,": 892,
  "phu.": 893,
  "đông.": 894,
  "tẩm,": 895,
  "xanh.": 896,
  "khó": 897,
  "xác": 898,
  "mà": 899,
  "nguyễn": 900,
  "hồi,": 901,
  "hệ": 902,
  "trụ...": 903,
  "mua": 904,
  "sắc.": 905,
  "lớn,": 906,
  "tiếng": 907,
  "trùng": 908,
  "bá": 909,
  "đời,": 910,
  "mở": 911,
  "tình": 912,
  "trạng": 913,
  "năm": 914,
  "1896": 915,
  "dòng": 916,
  "kích": 917,
  "thước.": 918,
  "nghiêm.": 919,
  "cuốn": 920,
  "màu,": 921,
  "lung": 922,
  "ống.": 923,
  "doanh.": 924,
  "khứ": 925,
  "đêm.": 926,
  "tổng": 927,
  "á-âu": 928,
  "giản,": 929,
  "tre": 930,
  "nứa.": 931,
  "đêm,": 932,
  "chiếu": 933,
  "sáng.": 934,
  "vì": 935,
  "riêng.": 936,
  "tâm.": 937,
  "ở,": 938,
  "đề": 939,
  "học,": 940,
  "điêu": 941,
  "khắc.": 942,
  "trí,": 943,
  "bền": 944,
  "vững": 945,
  "đỏ.": 946,
  "duy": 947,
  "nhất.": 948,
  "thuyết.": 949,
  "tải": 950,
  "hoá,": 951,
  "tối": 952,
  "bất": 953,
  "đồng,": 954,
  "văng,": 955,
  "tế.": 956,
  "nhạc": 957,
  "thiêng,": 958,
  "kế.": 959,
  "khẳng": 960,
  "gốc": 961,
  "vĩ": 962,
  "roman": 963,
  "triết": 964,
  "chuông,": 965,
  "hồng,": 966,
  "lược": 967,
  "ống": 968,
  "rường.": 969,
  "đao": 970,
  "vút": 971,
  "lên.": 972,
  "kể": 973,
  "vườn,": 974,
  "mắn": 975,
  "đúc": 976,
  "tròn": 977,
  "nhau": 978,
  "hạnh": 979,
  "phúc": 980,
  "ấm": 981,
  "giáo,": 982,
  "gần": 983,
  "gũi": 984,
  "nhiên,": 985,
  "quân": 986,
  "nâng": 987,
  "lượng": 988,
  "sống.": 989,
  "hơn,": 990,
  "dốc,": 991,
  "ô,": 992,
  "công.": 993,
  "tố": 994,
  "gothic-romanesque,": 995,
  "đỏ,": 996,
  "vĩnh": 997,
  "thuận.": 998,
  "cạnh": 999,
  "đáp": 1000,
  "ứng": 1001,
  "nhu": 1002,
  "dạng.": 1003,
  "gốc.": 1004,
  "vòm,": 1005,
  "sáng": 1006,
  "hiểu": 1007,
  "dục.": 1008,
  "dục,": 1009
}